#### BuiltInFailures.InterferenceFailures Members

---

|  |
| --- |
| BuiltInFailures InterferenceFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures InterferenceFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | GeometryWarning | A geometrical error has occurred while checking for Interference. Reported interference may not be accurate. |

# See Also

BuiltInFailures InterferenceFailures Class

Autodesk.Revit.DB Namespace